/****************************************Copyright (c)************************************************
** File name:			NTC_table.h
** Last modified Date:          
** Last Version:		V1.0   
** Created by:			谢彪
** Created date:		2021-01-05
** Version:			    1.0
** Descriptions:		NTC温感电阻阻值和温度对照表头文件
******************************************************************************************************/
#ifndef __NTC_TABLE_H__
#define __NTC_TABLE_H__

#include <zephyr.h>
#include <stdio.h>
#include <zephyr/types.h>

#define TEMPER_NUM_MAX	34
typedef struct
{
	int16_t temperature;
	float impedance;
}ntctable;

static ntctable ntc_table[TEMPER_NUM_MAX] = 
{
	{-40,195.652},
	{-35,148.171},
	{-30,113.347},
	{-25, 87.559},
	{-20, 68.237},
	{-15, 53.650},
	{-10, 42.506},
	{ -5, 33.892},
	{  0, 27.219},
	{  5, 22.021},
	{ 10, 17.926},
	{ 15, 14.674},
	{ 20, 12.081},
	{ 25, 10.000},
	{ 30,  8.315},
	{ 35,  6.948},
	{ 40,  5.834},
	{ 45,  4.917},
	{ 50,  4.161},
	{ 55,  3.535},
	{ 60,  3.014},
	{ 65,  2.586},
	{ 70,  2.228},
	{ 75,  1.925},
	{ 80,  1.669},
	{ 85,  1.452},
	{ 90,  1.268},
	{ 95,  1.110},
	{100,  0.974},
	{105,  0.858},
	{110,  0.758},
	{115,  0.672},
	{120,  0.596},
	{125,  0.531}	
};

#endif/*__NTC_TABLE_H__*/
